Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70J21.xml
        <register caption="Global Channel Software Flush Request Register" name="XDMAC_GSWF" offset="0x40" rw="W" size="4">
          <bitfield caption="XDMAC Channel 0 Software Flush Request Bit" mask="0x00000001" name="SWF0"/>
          <bitfield caption="XDMAC Channel 1 Software Flush Request Bit" mask="0x00000002" name="SWF1"/>
          <bitfield caption="XDMAC Channel 2 Software Flush Request Bit" mask="0x00000004" name="SWF2"/>
          <bitfield caption="XDMAC Channel 3 Software Flush Request Bit" mask="0x00000008" name="SWF3"/>
          <bitfield caption="XDMAC Channel 4 Software Flush Request Bit" mask="0x00000010" name="SWF4"/>
          <bitfield caption="XDMAC Channel 5 Software Flush Request Bit" mask="0x00000020" name="SWF5"/>
          <bitfield caption="XDMAC Channel 6 Software Flush Request Bit" mask="0x00000040" name="SWF6"/>
          <bitfield caption="XDMAC Channel 7 Software Flush Request Bit" mask="0x00000080" name="SWF7"/>
          <bitfield caption="XDMAC Channel 8 Software Flush Request Bit" mask="0x00000100" name="SWF8"/>
          <bitfield caption="XDMAC Channel 9 Software Flush Request Bit" mask="0x00000200" name="SWF9"/>
          <bitfield caption="XDMAC Channel 10 Software Flush Request Bit" mask="0x00000400" name="SWF10"/>
          <bitfield caption="XDMAC Channel 11 Software Flush Request Bit" mask="0x00000800" name="SWF11"/>
          <bitfield caption="XDMAC Channel 12 Software Flush Request Bit" mask="0x00001000" name="SWF12"/>
          <bitfield caption="XDMAC Channel 13 Software Flush Request Bit" mask="0x00002000" name="SWF13"/>
          <bitfield caption="XDMAC Channel 14 Software Flush Request Bit" mask="0x00004000" name="SWF14"/>
          <bitfield caption="XDMAC Channel 15 Software Flush Request Bit" mask="0x00008000" name="SWF15"/>
          <bitfield caption="XDMAC Channel 16 Software Flush Request Bit" mask="0x00010000" name="SWF16"/>
          <bitfield caption="XDMAC Channel 17 Software Flush Request Bit" mask="0x00020000" name="SWF17"/>
          <bitfield caption="XDMAC Channel 18 Software Flush Request Bit" mask="0x00040000" name="SWF18"/>
          <bitfield caption="XDMAC Channel 19 Software Flush Request Bit" mask="0x00080000" name="SWF19"/>
          <bitfield caption="XDMAC Channel 20 Software Flush Request Bit" mask="0x00100000" name="SWF20"/>
          <bitfield caption="XDMAC Channel 21 Software Flush Request Bit" mask="0x00200000" name="SWF21"/>
          <bitfield caption="XDMAC Channel 22 Software Flush Request Bit" mask="0x00400000" name="SWF22"/>
          <bitfield caption="XDMAC Channel 23 Software Flush Request Bit" mask="0x00800000" name="SWF23"/>
        </register>
        <register caption="Channel Interrupt Enable Register (chid = 0)" name="XDMAC_CIE0" offset="0x50" rw="W" size="4">
          <bitfield caption="End of Block Interrupt Enable Bit" mask="0x00000001" name="BIE"/>
          <bitfield caption="End of Linked List Interrupt Enable Bit" mask="0x00000002" name="LIE"/>
          <bitfield caption="End of Disable Interrupt Enable Bit" mask="0x00000004" name="DIE"/>
          <bitfield caption="End of Flush Interrupt Enable Bit" mask="0x00000008" name="FIE"/>
          <bitfield caption="Read Bus Error Interrupt Enable Bit" mask="0x00000010" name="RBIE"/>
          <bitfield caption="Write Bus Error Interrupt Enable Bit" mask="0x00000020" name="WBIE"/>
          <bitfield caption="Request Overflow Error Interrupt Enable Bit" mask="0x00000040" name="ROIE"/>
        </register>
        <register caption="Channel Interrupt Disable Register (chid = 0)" name="XDMAC_CID0" offset="0x54" rw="W" size="4">
          <bitfield caption="End of Block Interrupt Disable Bit" mask="0x00000001" name="BID"/>
          <bitfield caption="End of Linked List Interrupt Disable Bit" mask="0x00000002" name="LID"/>
          <bitfield caption="End of Disable Interrupt Disable Bit" mask="0x00000004" name="DID"/>
          <bitfield caption="End of Flush Interrupt Disable Bit" mask="0x00000008" name="FID"/>
          <bitfield caption="Read Bus Error Interrupt Disable Bit" mask="0x00000010" name="RBEID"/>
          <bitfield caption="Write Bus Error Interrupt Disable Bit" mask="0x00000020" name="WBEID"/>
          <bitfield caption="Request Overflow Error Interrupt Disable Bit" mask="0x00000040" name="ROID"/>
        </register>
        <register caption="Channel Interrupt Mask Register (chid = 0)" name="XDMAC_CIM0" offset="0x58" rw="W" size="4">
          <bitfield caption="End of Block Interrupt Mask Bit" mask="0x00000001" name="BIM"/>
          <bitfield caption="End of Linked List Interrupt Mask Bit" mask="0x00000002" name="LIM"/>
          <bitfield caption="End of Disable Interrupt Mask Bit" mask="0x00000004" name="DIM"/>
          <bitfield caption="End of Flush Interrupt Mask Bit" mask="0x00000008" name="FIM"/>
          <bitfield caption="Read Bus Error Interrupt Mask Bit" mask="0x00000010" name="RBEIM"/>
          <bitfield caption="Write Bus Error Interrupt Mask Bit" mask="0x00000020" name="WBEIM"/>
          <bitfield caption="Request Overflow Error Interrupt Mask Bit" mask="0x00000040" name="ROIM"/>
        </register>
        <register caption="Channel Interrupt Status Register (chid = 0)" name="XDMAC_CIS0" offset="0x5C" rw="R" size="4">
          <bitfield caption="End of Block Interrupt Status Bit" mask="0x00000001" name="BIS"/>
          <bitfield caption="End of Linked List Interrupt Status Bit" mask="0x00000002" name="LIS"/>
          <bitfield caption="End of Disable Interrupt Status Bit" mask="0x00000004" name="DIS"/>
          <bitfield caption="End of Flush Interrupt Status Bit" mask="0x00000008" name="FIS"/>
          <bitfield caption="Read Bus Error Interrupt Status Bit" mask="0x00000010" name="RBEIS"/>
          <bitfield caption="Write Bus Error Interrupt Status Bit" mask="0x00000020" name="WBEIS"/>
          <bitfield caption="Request Overflow Error Interrupt Status Bit" mask="0x00000040" name="ROIS"/>
        </register>
        <register caption="Channel Source Address Register (chid = 0)" name="XDMAC_CSA0" offset="0x60" rw="RW" size="4">
          <bitfield caption="Channel x Source Address" mask="0xFFFFFFFF" name="SA"/>
        </register>
